Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextAttributes
The DimensionTextAttributes class controls the dimension value representation.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextAttributes.Font
The font attributes.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextAttributes.Frame
The frame type of the dimension value text.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextAttributes.TextPlacing
The place of the dimension value text.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextAttributes.#ctor
Creates a new dimension text attributes instance. By default the default font is used, no frame is drawn
and the value text is above the dimension line.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextAttributes.#ctor(Tekla.Structures.Drawing.FontAttributes,Tekla.Structures.Drawing.DimensionSetBaseAttributes.FrameTypes,Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextPlacings)
Creates a new dimension text attributes instance with the given parameters.
font: The font attributes of the dimension value text.
frame: The frame type of the dimension value text.
textPlacing: The place of the dimension value text.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.